app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT * FROM "accounts"

  def show
    @account = Account.find(params[:id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)

  def edit
    @account = Account.find(params[:id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)

  def create
    @account = Account.new(params[:account])

    respond_to do |format|


      if @account.save

        # create initial dashboard
        dashboard = Dashboard.new
        dashboard.name = @account.name + " Dashboard"
        dashboard.account_id = @account.id
        dashboard.save

        #send welcome mail to user
        @user = User.new
        @user.account_id = @account.id
        @user.first_name = @account.contact_firstname
        @user.last_name = @account.contact_lastname
        @user.email = @account.contact_email
        logger.debug "Creating user #{@user.email}"
        new_password = @user.set_random_password
        #new_password = user.set_random_password
        #Emailer.deliver_welcome_email(user, new_password)
        @user.save
---
INSERT INTO "accounts" ("name", "contact_firstname", "contact_lastname", "contact_email", "start_date", "plan", "created_at", "updated_at") VALUES('ClearSignal', 'Aaron', 'Aycock', 'aaron@clearsignalsoft.com', '2010-08-01', 'Corporate', '2010-08-21 06:10:06', '2010-08-21 06:10:06')
INSERT INTO "dashboards" ("name", "created_at", "updated_at", "account_id", "description") VALUES('MySpin2 Dashboard', '2010-08-27 02:03:49', '2010-08-27 02:03:49', 11, NULL)
INSERT INTO "users" ("salt", "created_at", "updated_at", "hashed_password", "account_id", "last_name", "first_name", "email") VALUES('21753976400.848816914470416', '2010-08-27 02:08:53', '2010-08-27 02:08:53', 'fefc6fd9125f4822ad63dff4550eb330587a6541', 12, 'Aycock', 'Aaron', 'aaron.aycock@spinnakertek.com')

  def update
    @account = Account.find(params[:id])

    respond_to do |format|
      if @account.update_attributes(params[:account])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
UPDATE "accounts" SET "updated_at" = '2010-08-19 14:07:17', "start_date" = '2010-08-07' WHERE "id" = 1