app/controllers/admin_controller.rb

  def home
    user_id = session[:user_id]
    user = User.find(user_id)
    account_id = Account.find(user.account_id)
    @services = Service.find_all_by_account_id(account_id)
---
SELECT * FROM "services" WHERE ("services"."account_id" = 1)