app/controllers/admin_controller.rb

  def home
    @edit = true
    user_id = session[:user_id]
    @offset = params[:offset].to_i
    if @offset.nil?
      @offset = 0
    end
    user = User.find(user_id)
    account_id = Account.find(user.account_id)
    @dashboard = Dashboard.find_by_account_id(account_id)
    #  @dashboard = dashboards[0] Add back when we handle multiple dashboards
    @services = Service.find_all_by_dashboard_id(session[:dashboard_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
SELECT * FROM "dashboards" WHERE ("dashboards"."account_id" = 20) LIMIT 1
SELECT * FROM "services" WHERE ("services"."dashboard_id" = 1)

  def dashboard
    @edit=false
    dashboard_id = params[:id]
    @offset = params[:offset].to_i
    if @offset.nil?
      @offset = 0
    end

    @dashboard = Dashboard.find(dashboard_id)
    @services = Service.find_all_by_dashboard_id(dashboard_id)
---
SELECT * FROM "dashboards" WHERE ("dashboards"."id" = 16)
SELECT * FROM "services" WHERE ("services"."dashboard_id" = '16')

  def my_account
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def login
    if request.post?
      user = User.authenticate(params[:email], params[:password])
      if user
        session[:user_id] = user.id
        session[:account_id] = user.account_id
        session[:user_first_name] = user.first_name
        session[:user_last_name] = user.last_name
        session[:dashboard_id] = Dashboard.find_by_account_id(user.account_id).id
---
SELECT * FROM "users" WHERE ("users"."email" = 'aaron.aycock@gmail.com') LIMIT 1
SELECT * FROM "dashboards" WHERE ("dashboards"."account_id" = 1) LIMIT 1

  def forgot_password
    if request.post?
      logger.debug "Inside password reset!!!"
      u= User.find_by_email(params[:email])
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'aaron.aycock@gmail.com' AND "users".id <> 1) LIMIT 1

  def reset_password
    @user = User.find(session[:user_id])
    if request.post?
      if(params[:password] != params[:password_confirmation])
        flash[:error]="Passwords don't match"
        redirect_to( :action => "reset_password")
      else
        @user.update_attributes(:password=>params[:password], :password_confirmation => params[:password_confirmation])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-08-22 23:22:13', "salt" = '21756714200.891686744834159', "hashed_password" = '9c02b795cd22985658431bd5eac05950410bc6a0' WHERE "id" = 1