app/controllers/events_controller.rb

SELECT * FROM "events"
---
  def index
    @events = Event.all

SELECT * FROM "events" WHERE ("events"."id" = 1)
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("created_at", "timestamp", "updated_at", "level", "service_id", "message") VALUES('2010-08-23 02:33:41', '2010-08-20 02:28:00', '2010-08-23 02:33:41', 4, 1, 'Email down because of DNS')
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "updated_at" = '2010-08-23 17:49:24', "message" = 'TeamSpace temporarily unavailable for schedule backup maintenance' WHERE "id" = 1
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT * FROM "events" WHERE ("events"."id" = 11)
DELETE FROM "events" WHERE "id" = 11
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy