app/controllers/services_controller.rb

SELECT * FROM "services"
---
  def index
    @services = Service.all