app/controllers/services_controller.rb

  def create
    #logger.debug "account_id: #{params[:account_id]}"
   @account = Account.find(session[:account_id])
   @service = @account.services.create(params[:service])
   @service.dashboard_id = session[:dashboard_id]
   @service.save
---
UPDATE "services" SET "updated_at" = '2010-08-27 03:47:45', "dashboard_id" = 15 WHERE "id" = 22