app/controllers/services_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
SELECT * FROM "services" WHERE ("services"."account_id" = 1)
---
  def index
    user_id = session[:user_id]
    user = User.find(user_id)
    account_id = Account.find(user.account_id)
    @services = Service.find_all_by_account_id(account_id)

SELECT * FROM "services" WHERE ("services"."id" = 1)
---
  def show
    @service = Service.find(params[:id])

SELECT * FROM "services" WHERE ("services"."id" = 1)
---
  def edit
    @service = Service.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
INSERT INTO "services" ("name", "created_at", "updated_at", "account_id", "description", "dashboard_id") VALUES('My first service', '2010-08-27 03:27:37', '2010-08-27 03:27:37', 20, 'description here', NULL)
---
  def create
    #logger.debug "account_id: #{params[:account_id]}"
   @account = Account.find(1) # TODO Replace with real account_id from session
   @service = @account.services.create!(params[:service])

SELECT * FROM "services" WHERE ("services"."id" = 1)
UPDATE "services" SET "name" = 'Email2', "updated_at" = '2010-08-21 20:01:23' WHERE "id" = 1
---
  def update
    @service = Service.find(params[:id])

    respond_to do |format|
      if @service.update_attributes(params[:service])

SELECT * FROM "services" WHERE ("services"."id" = 7)
DELETE FROM "services" WHERE "id" = 7
---
  def destroy
    @service = Service.find(params[:id])
    @service.destroy