app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :last_name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("salt", "created_at", "updated_at", "hashed_password", "account_id", "last_name", "first_name", "email") VALUES('21757332000.856468102494226', '2010-08-22 18:38:40', '2010-08-22 18:38:40', 'cd51382bfa3b569b20679e1509ed84954045289d', 1, 'Aycock', 'Aaron', 'aaron.aycock@spinnakertek.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-08-22 23:02:50', "salt" = '21756132200.770760912721018', "hashed_password" = 'd116f9515c2d5c99d2faf8ab1668afcc37524f0d' WHERE "id" = 1