app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."account_id" = 2) ORDER BY last_name
---
  def index
    #@users = User.find(:all, :order => :last_name)
    @users = User.find_all_by_account_id(session[:account_id],:order => :last_name )